[{
        "img": "./images/nursery.jpg",
        "title": "The Nest - Nursery",
        "desc": "An online platform dedicated to nurseries offering a wide range of plants and gardening tools for enthusiasts. Secure user accounts with login/logout functionality. Browse and search for various plants and gardening tools.",
        "tech": ["MongoDB", "ExpressJS", "ReactJS", "NodeJS", "TailwindCSS"],
        "link": "https://github.com/adivikramp/theNest"
    },
    {
        "img": "./images/bloggy.jpg",
        "title": "Bloggy",
        "desc": "A dynamic online platform designed for blog enthusiasts to publish, share, and engage with a community of bloggers. Secure user accounts with login/logout functionality. Users can create, edit, and delete their own blog posts. Explore a collection of blogs posted by other users. Manage personal information and view own blog posts.",
        "tech": ["MongoDB", "ExpressJS", "ReactJS", "NodeJS", "TailwindCSS"],
        "link": "https://github.com/adivikramp/Bloggy"
    },
    {
        "img": "./images/library.jpg",
        "title": "BookQuest",
        "desc": "An online library management system facilitating students to access and borrow books from a digital library, managed by administrators having intuitive and visually appealing interface for students and administrators. Developed a dashboard with comprehensive functionality for administrators to manage book requests, inventory, and user accounts. Integrated search functionality for easy navigation through the library catalog and implemented In-app notifications for students regarding book loan approvals/rejections.",
        "tech": ["MongoDB", "ExpressJS", "EJS", "NodeJS", "TailwindCSS"],
        "link": "https://github.com/TEAMIRAGE/BookQuest"
    },
    {
        "img": "./images/medical.jpg",
        "title": "HealthSquare",
        "desc": "Offers advanced medical scanning for fractures and generates reports for thyroid and CBC analysis with a user-friendly interface. I Tried to enhance user experience, ensure clear presentation of medical information, and accommodate users. Worked closely with the backend team to integrate frontend with advanced functionalities. Aimed to contribute to the overall success of HealthSquare in revolutionizing healthcare delivery through effective frontend development.",
        "tech": ["MongoDB", "ExpressJS", "EJS", "NodeJS", "VertexAI", "TailwindCSS"],
        "link": "https://github.com/TEAMIRAGE/HealthSquare"
    },
    {
        "img": "./images/cryptoworld.png",
        "title": "CryptoWorld",
        "desc": "Created a dynamic online platform that delivers the latest cryptocurrency trends, tailored for enthusiasts and investors. The platform provides real-time updates, market insights, and engaging content to keep users informed and ahead of the curve in the fast-evolving crypto space.",
        "tech": ["ReactJS", "TailwindCSS", "Aceternity UI", "Daisy UI", "Context-API", "ChartJS"],
        "link": "https://cryptoworld-eight.vercel.app/"
    },
    {
        "img": "./images/wild-oasis.png",
        "title": "The Wild Oasis",
        "desc": "Developed a comprehensive hotel booking system that facilitates both guest reservations and admin management. The platform includes a user-friendly dashboard for managing bookings, inventory, and user accounts. It enables seamless reservation handling, real-time availability updates, and efficient user account management, offering a streamlined experience for both guests and administrators.",
        "tech": ["NextJS", "Next-Auth (Auth.js)", "TailwindCSS", "Supabase"],
        "link": "https://wild-oasis-nextjs-alpha.vercel.app/"
    },
    {
        "img": "./images/huly-clone.png",
        "title": "Huly Website Clone",
        "desc": "Cloned The huly.io website.",
        "tech": ["NextJS", "TailwindCSS", "ShadCN", "Aceternity UI", "motion (framer-motion)", "SwiperJS"],
        "link": "https://huly-clone-seven.vercel.app/"
    }
]